# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름: 홍영주
학번: 201403641
학과: 영어학부
제출일: Dec 02, 2020
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 18번 20점, 총200점**

In [2]:
%load_ext sql

In [3]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\youngju hong\anaconda3\lib\site-packages (0.10.1)

### Use your host, id, password, and database

In [4]:
import getpass
user = 'hong'
password = getpass.getpass()
host='database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com'
database = ''
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

········

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab on AWS RDS"

In [23]:
%sql USE companydb;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [22]:
%%sql
DROP TEMPORARY TABLE IF EXISTS tempssn;
CREATE TEMPORARY TABLE tempssn
SELECT E1.Ssn as ssn1, E2.Ssn, E2.Superssn
FROM EMPLOYEE E1, EMPLOYEE E2
WHERE E1.Ssn = 888665555;
select * from tempssn;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
8 rows affected.
8 rows affected.

[('888665555', '888665555', None),
 ('888665555', '123456789', '333445555'),
 ('888665555', '453453453', '333445555'),
 ('888665555', '666884444', '333445555'),
 ('888665555', '333445555', '888665555'),
 ('888665555', '987654321', '888665555'),
 ('888665555', '987987987', '987654321'),
 ('888665555', '999887777', '987654321')]

In [24]:
%sql DROP TEMPORARY TABLE IF EXISTS tempssn;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [29]:
%%sql

SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;

DROP DATABASE IF EXISTS companydb;
CREATE DATABASE IF NOT EXISTS companydb;
USE companydb;

DROP TABLE IF EXISTS DEPENDENT;
DROP TABLE IF EXISTS WORKS_ON;
DROP TABLE IF EXISTS PROJECT;
DROP TABLE IF EXISTS DEPT_LOCATIONS;
DROP TABLE IF EXISTS DEPARTMENT;
DROP TABLE IF EXISTS EMPLOYEE;

CREATE TABLE EMPLOYEE
(       Fname VARCHAR(15) NOT NULL,
        Minit CHAR,
        Lname VARCHAR(15) NOT NULL,
        Ssn CHAR(9) NOT NULL,
        Bdate DATE,
        Address VARCHAR(30),
        Sex CHAR,
        Salary DECIMAL(10, 2),
        Superssn CHAR(9),
        Dno INT,
        PRIMARY KEY (Ssn),
        FOREIGN KEY (Superssn) 
                REFERENCES EMPLOYEE(Ssn) 
                ON DELETE SET NULL
                ON UPDATE CASCADE,
        FOREIGN KEY (Dno) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPARTMENT
(       Dname VARCHAR(15) NOT NULL,
        Dnumber INT NOT NULL,
        Mgrssn CHAR(9),
        Mgrstartdate DATE,
        PRIMARY KEY (Dnumber),
        UNIQUE (Dname),
        FOREIGN KEY (Mgrssn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPT_LOCATIONS
(       Dnumber INT NOT NULL,
        Dlocation VARCHAR(15) NOT NULL,
        PRIMARY KEY (Dnumber, Dlocation),
        FOREIGN KEY (Dnumber)
                REFERENCES DEPARTMENT(Dnumber) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE PROJECT
(       Pname VARCHAR(15) NOT NULL,
        Pnumber INT NOT NULL,
        Plocation VARCHAR(15),
        Dnum INT,
        PRIMARY KEY (Pnumber),
        UNIQUE (Pname),
        FOREIGN KEY (Dnum) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE WORKS_ON
(       Essn CHAR(9) NOT NULL,
        Pno INT NOT NULL,
        Hours DECIMAL(3, 1) ,
        PRIMARY KEY (Essn, Pno),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Pno) 
                REFERENCES PROJECT(Pnumber)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPENDENT
(       Essn CHAR(9) NOT NULL,
        Dependent_name VARCHAR(15) NOT NULL,
        Sex CHAR,
        Bdate DATE,
        Relationship VARCHAR(8),
        PRIMARY KEY (Essn, Dependent_name),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


insert into EMPLOYEE values
        ("John", "B", "Smith", "123456789","1965-01-09", "731-Fondren-Houston-TX", "M", 30000, "333445555", 5),
        ("Franklin", "T", "Wong", "333445555","1955-12-08", "638-Voss-Houston-TX", "M", 40000, "888665555", 5),
        ("Alicia", "J", "Zelaya", "999887777", "1968-01-19", "3321-Castle-Spring-TX", "F", 25000, "987654321", 4),
        ("Jennifer", "S", "Wallace", "987654321", "1941-06-20", "291-Berry-Bellaire-TX", "F", 43000, "888665555", 4),
        ("Ramesh", "K", "Narayan", "666884444", "1962-09-15", "975-Fire-Oak-Humble-TX", "M", 38000, "333445555", 5),
        ("Joyce", "A", "English", "453453453", "1972-07-31", "5631-Rice-Houston-TX", "F", 25000, "333445555", 5),
        ("Ahmad", "V", "Jabbar", "987987987", "1969-03-29", "980-Dallas-Houston-TX", "M", 25000, "987654321", 4),
        ("James", "E", "Borg", "888665555", "1937-11-10", "450-Stone-Houston-TX", "M", 55000, NULL, 1);


insert into DEPENDENT  values 
        (333445555, "Alice", "F","1986-04-05", "Daughter"),
        (333445555, "Theodore", "M","1983-10-25", "Son"),
        (333445555, "Joy", "F","1958-05-03", "Spouse"),
        (987654321, "Abner", "M","1942-02-28", "Spouse"),
        (123456789, "Michael", "M","1988-01-04", "Son"),
        (123456789, "Alice", "F", "1988-12-30", "Daughter"),
        (123456789, "Elizabeth", "F", "1967-05-05", "Spouse");


insert into DEPARTMENT values 
        ("Research", 5, 333445555,"1988-05-22"),
        ("Administration", 4, 987654321,"1995-01-01"),
        ("Headquarters", 1, 888665555,"1981-06-19");

insert into DEPT_LOCATIONS values 
        (1, "Houston"),
        (4, "Stafford"),
        (5, "Bellaire"),
        (5, "Sugarland"),
        (5, "Houston");


insert into PROJECT values 
        ("ProductX", 1, "Bellaire", 5),
        ("ProductY", 2, "Sugarland", 5),
        ("ProductZ", 3, "Houston", 5),
        ("Computerization", 10, "Stafford", 4),
        ("Reorganization", 20, "Houston", 1),
        ("Newbenefits", 30, "Stafford", 4);


insert into WORKS_ON values
        (123456789, 1, 32.5),
        (123456789, 2, 7.5),
        (666884444, 3, 40.0),
        (453453453, 1, 20.0),
        (453453453, 2, 20.0),
        (333445555, 2, 10.0),
        (333445555, 3, 10.0),
        (333445555, 10, 10.0),
        (333445555, 20, 10.0),
        (999887777, 30, 30.0),
        (999887777, 10, 10.0),
        (987987987, 10, 35.0),
        (987987987, 30, 5.0),
        (987654321, 30, 20.0),
        (987654321, 20, 15.0),
        (888665555, 20, NULL); 

SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
6 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.
7 rows affected.
3 rows affected.
5 rows affected.
6 rows affected.
16 rows affected.
0 rows affected.
0 rows affected.

[]

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-13번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [5]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E.FNAME, " ", E.MINIT, ". ", E.LNAME) "Employee name"
FROM EMPLOYEE E, WORKS_ON W, PROJECT P
WHERE P.Pname = "ProductX" and W.Pno = P.Pnumber and E.Ssn = W.Essn

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [6]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E.FNAME, " ", E.MINIT, ". ", E.LNAME) "Employee name"
FROM EMPLOYEE AS E
WHERE EXISTS (
    SELECT *
    FROM DEPENDENT D
    WHERE E.Sex = D.Sex and E.Ssn = D.Essn
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [13]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E1.FNAME, " ", E1.MINIT, ". ", E1.LNAME) "Employee name"
FROM EMPLOYEE AS E1
WHERE EXISTS (
    SELECT *
    FROM EMPLOYEE AS E2
    WHERE E1.Superssn = E2.Ssn AND E2.Fname = "Franklin" and E2.Lname = "Wong"
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [21]:
%%sql
-- YOUR CODE HERE

SELECT Pname "Project name", SUM(Hours) "Total hours"
FROM EMPLOYEE, PROJECT, WORKS_ON
WHERE Ssn = Essn and Pnumber = Pno
GROUP BY Pname

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('Computerization', Decimal('55.0')),
 ('Newbenefits', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductY', Decimal('37.5')),
 ('ProductZ', Decimal('50.0')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [4]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(FNAME, " ", MINIT, ". ", LNAME) "Employee name"
FROM EMPLOYEE
WHERE NOT EXISTS (
    SELECT PNUMBER
    FROM PROJECT, DEPARTMENT
    WHERE PROJECT.Dnum = DEPARTMENT.Dnumber and Dname = "Administration" AND NOT EXISTS (SELECT *
    FROM WORKS_ON
    WHERE PNUMBER=PNO AND ESSN=SSN ))

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Ahmad V. Jabbar',), ('Alicia J. Zelaya',)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [23]:
%%sql

SELECT CONCAT(FNAME, " ", MINIT, ". ", LNAME) "Employee name" FROM EMPLOYEE
WHERE NOT EXISTS (
    SELECT *
    FROM WORKS_ON, PROJECT
    WHERE Plocation = "Houston" and Pnumber = Pno and Ssn = Essn)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [19]:
%%sql
-- YOUR CODE HERE

SELECT DNAME "Department name", TRUNCATE(AVG(SALARY), 2) "Average salary"
FROM DEPARTMENT, EMPLOYEE
WHERE DNUMBER=DNO
GROUP BY DNAME

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Administration', Decimal('31000.00')),
 ('Headquarters', Decimal('55000.00')),
 ('Research', Decimal('33250.00'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [55]:
%%sql
-- YOUR CODE HERE

SELECT TRUNCATE(AVG(SALARY),2) "Average salary"
FROM EMPLOYEE
WHERE SEX='F';

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[(Decimal('31000.00'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [59]:
%%sql
-- YOUR CODE HERE

select CONCAT(FNAME, " ", MINIT, ". ", LNAME) "Employee name", Address
    FROM EMPLOYEE E
    WHERE EXISTS (
            SELECT *
            FROM WORKS_ON W, PROJECT P
            WHERE P.Plocation = "Houston" and P.Pnumber = W.Pno and E.Ssn = W.Essn )
    AND NOT EXISTS (
            SELECT *
            WHERE Address like "%Houston%")

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Ramesh K. Narayan', '975-Fire-Oak-Humble-TX'),
 ('Jennifer S. Wallace', '291-Berry-Bellaire-TX')]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [24]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(FNAME, " ", MINIT, ". ", LNAME) "Employee name"
    FROM EMPLOYEE
    WHERE EXISTS (SELECT * FROM DEPARTMENT WHERE SSN=MGRSSN)
    AND NOT EXISTS ( SELECT * FROM DEPENDENT WHERE SSN=ESSN)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('James E. Borg',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [25]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(FNAME, " ", MINIT, ". ", LNAME) "Employee name"
FROM EMPLOYEE
WHERE Dno = 
    (SELECT Dno
     FROM EMPLOYEE
     WHERE SALARY = (SELECT MAX(SALARY) FROM EMPLOYEE))

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('James E. Borg',)]

In [28]:
%%sql
-- YOUR CODE HERE

SELECT *
FROM EMPLOYEE
WHERE Dno = 
(SELECT Dno FROM EMPLOYEE WHERE SALARY = 
 (SELECT MAX(SALARY) FROM EMPLOYEE));

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1)]

#### 12-1. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [63]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E1.Fname, " ", E1.Minit, ". ", E1.Lname) "Employee name"
FROM EMPLOYEE E1
WHERE EXISTS (
    SELECT *
    FROM EMPLOYEE E2
    WHERE E1.Superssn = E2.Ssn
    AND EXISTS (
        SELECT *
        FROM EMPLOYEE E3
        WHERE E2.Superssn = E3.Ssn AND E3.Lname = "Borg" AND E3.Fname = "James"))

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 12-2. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [64]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E1.Fname, " ", E1.Minit, ". ", E1.Lname) "Employee name"
FROM EMPLOYEE E1, EMPLOYEE E2, EMPLOYEE E3
WHERE E1.Superssn = E2.Ssn
AND E2.Superssn = E3.Ssn
AND E3.Fname = "James"
AND E3.Lname = "Borg"

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [66]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(FNAME, " ", MINIT, ". ", LNAME) "Employee name"
FROM EMPLOYEE E
WHERE SALARY >= 10000 + (SELECT MIN(SALARY) FROM EMPLOYEE)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Franklin T. Wong',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Jennifer S. Wallace',)]

### 14-17번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 14. A view that has the department name, manager name, and manager salary for every department

In [70]:
%sql DROP VIEW DEPT_VIEW

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [72]:
%%sql
-- YOUR CODE HERE
CREATE VIEW DEPT_VIEW(DEPT_NAME, MANAGER_SSN, SALARY)
AS
SELECT D.Dname, D.Mgrssn, E.Salary
FROM DEPARTMENT D, EMPLOYEE E
WHERE D.Mgrssn = E.Ssn

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [73]:
%sql select * from DEPT_VIEW;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Headquarters', '888665555', Decimal('55000.00')),
 ('Administration', '987654321', Decimal('43000.00')),
 ('Research', '333445555', Decimal('40000.00'))]

#### 15. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [94]:
%%sql
-- YOUR CODE HERE
CREATE VIEW RESEARCH_DEPT_VIEW(EMPLOYEE_NAME, SUPERVISOR_NAME, EMPLOYEE_SALARY)
AS
SELECT
CONCAT(E1.FNAME, " ", E1.MINIT, ". ", E1.LNAME),
CONCAT(E2.FNAME, " ", E2.MINIT, ". ", E2.LNAME),
E1.Salary
FROM EMPLOYEE E1, EMPLOYEE E2, DEPARTMENT D
WHERE E1.Superssn = E2.Ssn AND Dname = "Research" AND E1.Dno = D.Dnumber

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [95]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('John B. Smith', 'Franklin T. Wong', Decimal('30000.00')),
 ('Franklin T. Wong', 'James E. Borg', Decimal('40000.00')),
 ('Joyce A. English', 'Franklin T. Wong', Decimal('25000.00')),
 ('Ramesh K. Narayan', 'Franklin T. Wong', Decimal('38000.00'))]

#### 16. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [97]:
%%sql
-- YOUR CODE HERE

CREATE VIEW PROJECT_VIEW (PROJECT_NAME, CONTROLLING_DEPT_NAME, NUMBER_OF_EMPLOYEE, TOTAL_HOURS)
AS
SELECT P.Pname, D.Dname, COUNT(*), SUM(W.Hours)
FROM PROJECT P, DEPARTMENT D, WORKS_ON W
WHERE P.Dnum = D.Dnumber and W.Pno = P.Pnumber
GROUP BY P.Pname

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [98]:
%sql select * from PROJECT_VIEW;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0'))]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [99]:
%%sql
-- YOUR CODE HERE
CREATE VIEW PROJECT_VIEW_GT2 (PROJECT_NAME, CONTROLLING_DEPT_NAME, NUMBER_OF_EMPLOYEE, TOTAL_HOURS)
AS
SELECT P.Pname, D.Dname, COUNT(*), W.Hours
FROM PROJECT P, DEPARTMENT D, WORKS_ON W
WHERE P.Dnum = D.Dnumber and W.Pno = P.Pnumber
GROUP BY P.Pname
HAVING count(*) > 2

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [100]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Computerization', 'Administration', 3, Decimal('10.0')),
 ('Newbenefits', 'Administration', 3, Decimal('20.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('10.0')),
 ('ProductY', 'Research', 3, Decimal('7.5'))]

#### 18. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 18번 문제 Update 한 후에 1-17번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-17번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [101]:
%%sql
-- YOUR CODE HERE for "create table ..."

CREATE TABLE salary_audit
(
    ssn CHAR(9) NOT NULL,
    before_salary DECIMAL(10, 2) NOT NULL,
    after_salary DECIMAL(10, 2) NOT NULL,
    u_datetime TIMESTAMP,
    PRIMARY KEY (ssn, before_salary, after_salary),
    FOREIGN KEY (ssn)
        REFERENCES EMPLOYEE(Ssn)
        ON DELETE CASCADE
        ON UPDATE CASCADE
) ENGINE = InnoDB;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [102]:
%%sql
-- YOUR CODE HERE for "create trigger ..."

CREATE TRIGGER RECORD_SALARY
AFTER UPDATE ON EMPLOYEE
FOR EACH ROW
BEGIN
    IF (NEW.Salary <> OLD.Salary)
    THEN INSERT INTO salary_audit values (OLD.Ssn, OLD.Salary, NEW.Salary, now());
    END IF;
END;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [103]:
%sql select * from salary_audit;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [104]:
%sql select * from EMPLOYEE

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [105]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[]

In [106]:
%sql select * from salary_audit;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('123456789', Decimal('30000.00'), Decimal('60000.00'), datetime.datetime(2020, 12, 3, 5, 35, 39)),
 ('333445555', Decimal('40000.00'), Decimal('80000.00'), datetime.datetime(2020, 12, 3, 5, 35, 39)),
 ('453453453', Decimal('25000.00'), Decimal('50000.00'), datetime.datetime(2020, 12, 3, 5, 35, 39)),
 ('666884444', Decimal('38000.00'), Decimal('76000.00'), datetime.datetime(2020, 12, 3, 5, 35, 39))]

In [108]:
%sql select * from EMPLOYEE

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('60000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('80000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('50000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('76000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]